Revit 2027 API
MeshFromGeometryOperationResult.Tessellated Property
 Whether while constructing a mesh, it was necessary to extrude polylines instead of non-linear curves from the profile loops.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Tessellated { get; }
Public ReadOnly Property Tessellated As Boolean
	Get
public:
property bool Tessellated {
	bool get ();
}
member Tessellated : bool with get
Property Value
Boolean
See Also
Reference
MeshFromGeometryOperationResult Class
Autodesk.Revit.DB Namespace